{
  "nodes": [
    {
      "op": "null", 
      "name": "pf_features", 
      "attrs": {"__shape__": "(1, 25, 100)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 25, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_features", 
      "attrs": {"__shape__": "(1, 12, 7)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 12, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "-1", 
        "num_args": "2"
      }, 
      "inputs": [[8, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv0_conv3_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 1], [29, 0, 1]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv0_expand_dims0", 
      "attrs": {"axis": "3"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "ParticleNet_pfcand_edgeconv0_tile0", 
      "attrs": {"reps": "(1, 1, 1, 16)"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "1", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_reshape0", 
      "attrs": {"shape": "(-1, 1, 1)"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_tile0", 
      "attrs": {"reps": "(1, 107, 16)"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pf_mask", 
      "attrs": {"__shape__": "(1, 1, 100)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_mask", 
      "attrs": {"__shape__": "(1, 1, 7)"}, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "-1", 
        "num_args": "2"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "ParticleNet_pfcand__not_equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_equal_scalar", 
      "name": "ParticleNet_pfcand__equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "ParticleNet_pfcand__mulscalar0", 
      "attrs": {"scalar": "99.0"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pf_points", 
      "attrs": {"__shape__": "(1, 2, 100)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_points", 
      "attrs": {"__shape__": "(1, 2, 7)"}, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "-1", 
        "num_args": "2"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "ParticleNet_pfcand_broadcast_add0", 
      "inputs": [[43, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0__mul0", 
      "inputs": [[47, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_transpose1", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_batch_dot0", 
      "inputs": [[51, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_broadcast_sub0", 
      "inputs": [[50, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0__mul1", 
      "inputs": [[47, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "ParticleNet_pfcand_edgeconv0_batchdistancematrix0_broadcast_add0", 
      "inputs": [[54, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "topk", 
      "name": "ParticleNet_pfcand_edgeconv0_topk0", 
      "attrs": {
        "axis": "-1", 
        "dtype": "float32", 
        "is_ascend": "True", 
        "k": "17", 
        "ret_typ": "indices"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "ParticleNet_pfcand_edgeconv0_slice_axis0", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[37, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "gather_nd", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_gather_nd0", 
      "inputs": [[33, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv0_nearestneighborsfromindices0_transpose1", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "ParticleNet_pfcand_edgeconv0__minus0", 
      "inputs": [[63, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ParticleNet_pfcand_edgeconv0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[32, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 1], [79, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv0_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv0_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv0_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv0_relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "ParticleNet_pfcand_edgeconv0_mean0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "ParticleNet_pfcand_edgeconv0__plus0", 
      "inputs": [[30, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv0_relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 64, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv1_conv3_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 1], [98, 0, 1]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv1_expand_dims0", 
      "attrs": {"axis": "3"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "ParticleNet_pfcand_edgeconv1_tile0", 
      "attrs": {"reps": "(1, 1, 1, 16)"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "1", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_reshape0", 
      "attrs": {"shape": "(-1, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_tile0", 
      "attrs": {"reps": "(1, 107, 16)"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "ParticleNet_pfcand_broadcast_add1", 
      "inputs": [[43, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0__mul0", 
      "inputs": [[107, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_transpose1", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_batch_dot0", 
      "inputs": [[111, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_broadcast_sub0", 
      "inputs": [[110, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0__mul1", 
      "inputs": [[107, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "ParticleNet_pfcand_edgeconv1_batchdistancematrix0_broadcast_add0", 
      "inputs": [[114, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "topk", 
      "name": "ParticleNet_pfcand_edgeconv1_topk0", 
      "attrs": {
        "axis": "-1", 
        "dtype": "float32", 
        "is_ascend": "True", 
        "k": "17", 
        "ret_typ": "indices"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "ParticleNet_pfcand_edgeconv1_slice_axis0", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[106, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "gather_nd", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_gather_nd0", 
      "inputs": [[102, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv1_nearestneighborsfromindices0_transpose1", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "ParticleNet_pfcand_edgeconv1__minus0", 
      "inputs": [[123, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ParticleNet_pfcand_edgeconv1_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[101, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv1_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv1_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv1_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 1], [147, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv1_relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "ParticleNet_pfcand_edgeconv1_mean0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "ParticleNet_pfcand_edgeconv1__plus0", 
      "inputs": [[99, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv1_relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 128, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv2_conv3_fwd", 
      "attrs": {
        "dilate": "(1,)", 
        "kernel": "(1,)", 
        "layout": "NCW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,)", 
        "stride": "(1,)"
      }, 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0], [157, 0, 1], [158, 0, 1]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv2_expand_dims0", 
      "attrs": {"axis": "3"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "ParticleNet_pfcand_edgeconv2_tile0", 
      "attrs": {"reps": "(1, 1, 1, 16)"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0__arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "1", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_reshape0", 
      "attrs": {"shape": "(-1, 1, 1)"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_tile0", 
      "attrs": {"reps": "(1, 107, 16)"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "ParticleNet_pfcand_broadcast_add2", 
      "inputs": [[43, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0__mul0", 
      "inputs": [[167, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_transpose1", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_transpose0", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_batch_dot0", 
      "inputs": [[171, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_broadcast_sub0", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0__mul1", 
      "inputs": [[167, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "ParticleNet_pfcand_edgeconv2_batchdistancematrix0_broadcast_add0", 
      "inputs": [[174, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "topk", 
      "name": "ParticleNet_pfcand_edgeconv2_topk0", 
      "attrs": {
        "axis": "-1", 
        "dtype": "float32", 
        "is_ascend": "True", 
        "k": "17", 
        "ret_typ": "indices"
      }, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "ParticleNet_pfcand_edgeconv2_slice_axis0", 
      "attrs": {
        "axis": "-1", 
        "begin": "1", 
        "end": "None"
      }, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "2"
      }, 
      "inputs": [[166, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "gather_nd", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_gather_nd0", 
      "inputs": [[162, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ParticleNet_pfcand_edgeconv2_nearestneighborsfromindices0_transpose1", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "ParticleNet_pfcand_edgeconv2__minus0", 
      "inputs": [[183, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ParticleNet_pfcand_edgeconv2_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[161, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 256, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ParticleNet_pfcand_edgeconv2_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "ParticleNet_pfcand_edgeconv2_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0], [189, 0, 0], [190, 0, 1], [191, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ParticleNet_pfcand_edgeconv2_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ParticleNet_pfcand_edgeconv2_conv1_weight", 
      "attrs": {
